---
kind: type
id: T:Autodesk.Revit.DB.GBXMLImportOptions
source: html/77a51362-e601-93b4-9b12-4241073778d4.htm
---
# Autodesk.Revit.DB.GBXMLImportOptions

Import options for Green-Building XML format.

## Syntax (C#)
```csharp
public class GBXMLImportOptions
```

## Remarks
Not used currently. Reserved for future use.